# 複素数

a = 1 + 3j  # 複素数aを定義します。実部が1で虚部が3です。
b = 3 + 5j  # 複素数bを定義します。実部が3で虚部が5です。
# print(a,b)  # 複素数aとbを出力します。
# print(a+b)  # 複素数aとbを加算した結果を出力します。
# print(a-b)  # 複素数aからbを減算した結果を出力します。
# print(a*b)  # 複素数aとbを乗算した結果を出力します。

# complex関数を使用した複素数の定義

a = complex(1,3)  # complex関数を使用して複素数aを定義します。実部が1で虚部が3です。
b = complex(3,5)  # complex関数を使用して複素数bを定義します。実部が3で虚部が5です。
print(a,b)  # 複素数aとbを出力します。
print(a+b)  # 複素数aとbを加算した結果を出力します。
print(a-b)  # 複素数aからbを減算した結果を出力します。
print(a*b)  # 複素数aとbを乗算した結果を出力します。

# 複素数の実部と虚部

print(a.real)  # 複素数aの実部を出力します。
print(a.imag)  # 複素数aの虚部を出力します。

""" 
複素数は、主に工学、物理学、数学などの科学的な分野で使用されます。以下にいくつかの具体的な例を挙げます。

1. 電気工学: 電気回路の解析では、交流電流の位相差を表現するために複素数が使用されます。また、フーリエ変換やラプラス変換などの数学的手法も複素数を用いています。

2. 量子力学: 量子状態を表現するために複素数が使用されます。これは、量子力学の基本的な方程式であるシュレーディンガー方程式が複素数を含むためです。

3. 信号処理: デジタル信号処理では、フーリエ変換や離散フーリエ変換（DFT）などの手法が用いられます。これらの変換は複素数を用いて信号の周波数成分を分析します。

4. 制御理論: 制御システムの安定性を分析するために、複素数平面（s平面）が使用されます。

5. 数学: 複素数は、多項式方程式のすべての解を見つけるための基本的なツールです。これは、代数の基本定理により保証されています。
"""
